#include<iostream>
#include<cstring>
#include<cmath>
#include<cstdlib>
#include<SDL2/SDL.h>

typedef float सङ्ख्या;

enum वर्णः {मौनम्,अत्,आत्,इत्,ईत्,उत्,ऊत्,ऋत्,ॠत्,ऌत्,ॡत्,एत्,ऐत्,ओत्,औत्,
					कः,खः,गः,घः,ङः,चः,छः,जः,झः,ञः,टः,ठः,डः,ढः,णः,तः,थः,दः,धः,नः,पः,फः,बः,भः,मः,यः,रः,लः,वः,शः,षः,सः,हः,
					विसर्गः,अनुस्वारः};

class वाचकम्
{
	class वदनम्
	{
	public:
		int भागाः,नासिक्यभागाः,नासिकास्थानम्;
		सङ्ख्या शब्दवेगः=343.0,मुखदैर्घ्यम्,*मुखविस्तारः,*नासिकाविस्तारः,*बाह्यम्,*आन्तरिकम्,*नासिक्यबाह्यम्,*नासिक्यान्तरिकम्;
		वदनम्(int भागेभ्यः,int नासिकास्थानाय,सङ्ख्या मुखदैर्घ्याय)
		{
			भागाः=भागेभ्यः;
			नासिकास्थानम्=नासिकास्थानाय;
			नासिक्यभागाः=भागाः-नासिकास्थानम्;
			मुखदैर्घ्यम्=मुखदैर्घ्याय;
			मुखविस्तारः=new सङ्ख्या[भागाः];
			नासिकाविस्तारः=new सङ्ख्या[नासिक्यभागाः];
			बाह्यम्=new सङ्ख्या[भागाः]();
			आन्तरिकम्=new सङ्ख्या[भागाः]();
			नासिक्यबाह्यम्=new सङ्ख्या[नासिक्यभागाः]();
			नासिक्यान्तरिकम्=new सङ्ख्या[नासिक्यभागाः]();
		}
		
		~वदनम्()
		{
			delete[] मुखविस्तारः;delete[] नासिकाविस्तारः;delete[] बाह्यम्;delete[] आन्तरिकम्;delete[] नासिक्यबाह्यम्;delete[] नासिक्यान्तरिकम्;
		}
		सङ्ख्या निर्गतिः()
		{
			return बाह्यम्[भागाः-1]+आन्तरिकम्[भागाः-1]+नासिक्यबाह्यम्[नासिक्यभागाः-1]+नासिक्यान्तरिकम्[नासिक्यभागाः-1];
		}
		void योजनम्(int भागः,सङ्ख्या मात्रा)
		{
			बाह्यम्[भागः]+=मात्रा/2.0;
			आन्तरिकम्[भागः]+=मात्रा/2.0;
		}
		सङ्ख्या प्रवाहः(सङ्ख्या कण्ठ्यम्)
		{
			सङ्ख्या नवबाह्यम्[भागाः+1],नवान्तरिकम्[भागाः+1],नवनासिक्यबाह्यम्[नासिक्यभागाः+1],नवनासिक्यान्तरिकम्[नासिक्यभागाः+1];
			for(int भागः=1;भागः<भागाः;भागः++)
			{
				सङ्ख्या प्रत्यागतिः=(मुखविस्तारः[भागः-1]-मुखविस्तारः[भागः])/(मुखविस्तारः[भागः-1]+मुखविस्तारः[भागः])*(बाह्यम्[भागः-1]+आन्तरिकम्[भागः]);
				नवबाह्यम्[भागः]=बाह्यम्[भागः-1]-प्रत्यागतिः;
				नवान्तरिकम्[भागः]=आन्तरिकम्[भागः]+प्रत्यागतिः;
			}
			for(int भागः=1;भागः<नासिक्यभागाः;भागः++)
			{
				सङ्ख्या प्रत्यागतिः=(नासिकाविस्तारः[भागः-1]-नासिकाविस्तारः[भागः])/(नासिकाविस्तारः[भागः-1]+नासिकाविस्तारः[भागः])*(नासिक्यबाह्यम्[भागः-1]+नासिक्यान्तरिकम्[भागः]);
				नवनासिक्यबाह्यम्[भागः]=नासिक्यबाह्यम्[भागः-1]-प्रत्यागतिः;
				नवनासिक्यान्तरिकम्[भागः]=नासिक्यान्तरिकम्[भागः]+प्रत्यागतिः;
			}
			
			नवबाह्यम्[0]=आन्तरिकम्[0]*0.75+कण्ठ्यम्;
			नवान्तरिकम्[भागाः]=बाह्यम्[भागाः-1]*(-0.85);
			नवनासिक्यान्तरिकम्[नासिक्यभागाः]=नासिक्यबाह्यम्[नासिक्यभागाः-1]*(-0.85);
			
			{
				सङ्ख्या योगः=मुखविस्तारः[नासिकास्थानम्]+मुखविस्तारः[नासिकास्थानम्-1]+नासिकाविस्तारः[0];
				{
					सङ्ख्या प्रत्यागतिः=(2.0*मुखविस्तारः[नासिकास्थानम्-1]-योगः)/योगः;
					नवान्तरिकम्[नासिकास्थानम्]=प्रत्यागतिः*बाह्यम्[नासिकास्थानम्-1]+(1.0+प्रत्यागतिः)*(नासिक्यान्तरिकम्[0]+आन्तरिकम्[नासिकास्थानम्]);
				}
				{
					सङ्ख्या प्रत्यागतिः=(2.0*मुखविस्तारः[नासिकास्थानम्]-योगः)/योगः;
					नवबाह्यम्[नासिकास्थानम्]=प्रत्यागतिः*आन्तरिकम्[नासिकास्थानम्]+(1.0+प्रत्यागतिः)*(नासिक्यान्तरिकम्[0]+बाह्यम्[नासिकास्थानम्-1]);
				}
				{
					सङ्ख्या प्रत्यागतिः=(2.0*नासिकाविस्तारः[0]-योगः)/योगः;
					नवनासिक्यबाह्यम्[0]=प्रत्यागतिः*नासिक्यान्तरिकम्[0]+(1.0+प्रत्यागतिः)*(बाह्यम्[नासिकास्थानम्-1]+आन्तरिकम्[नासिकास्थानम्]);
				}
			}
			
			memcpy(बाह्यम्,नवबाह्यम्,भागाः*sizeof(सङ्ख्या));
			memcpy(आन्तरिकम्,नवान्तरिकम्+1,भागाः*sizeof(सङ्ख्या));
			memcpy(नासिक्यबाह्यम्,नवनासिक्यबाह्यम्,नासिक्यभागाः*sizeof(सङ्ख्या));
			memcpy(नासिक्यान्तरिकम्,नवनासिक्यान्तरिकम्+1,नासिक्यभागाः*sizeof(सङ्ख्या));
			
			return मुखदैर्घ्यम्/(सङ्ख्या)भागाः/शब्दवेगः;
		}
	};
public:
	वदनम् यन्त्रम्;
	सङ्ख्या कालः=0;
	int ग्रहणानि=0;
	int नैमिषिकानि=16000;
	class वर्णसङ्ग्रहः
	{
		static const int अवकाशः=20;
		वर्णः सङ्ग्रहः[अवकाशः];
		size_t स्थानम्=0,आदिः=0,अन्तः=0;
		bool लोपः=false;
	public:
		struct वर्णक्रमः
		{
			वर्णः (*क्रमणम्)(void*);
			void* अन्वयः;
		};
	private:
		 वर्णक्रमः वर्णाः;
	public:
		वर्णसङ्ग्रहः(वर्णक्रमः यद्वर्णाः)
		{
			वर्णाः=यद्वर्णाः;
			सङ्ग्रहः[0]=वर्णाः.क्रमणम्(वर्णाः.अन्वयः);
		}
		
		template <typename अङ्कनम्>
		void वृद्धिः(अङ्कनम् & अङ्कः){अङ्कः++;if(अङ्कः==अवकाशः)अङ्कः=0;}
		template <typename अङ्कनम्>
		अङ्कनम् अन्तरम्(const अङ्कनम् आदिः,const अङ्कनम् अन्तः)
		{
			if(अन्तः>=आदिः)return अन्तः-आदिः;
			else return अन्तः-आदिः+अवकाशः;
		}
		
		वर्णः पठनम्(int अतिक्रमः=0)
		{
			if(अतिक्रमः==0)return सङ्ग्रहः[स्थानम्];
			else if(अतिक्रमः<0)
			{
				if(-अतिक्रमः<=अन्तरम्(आदिः,स्थानम्))
				{
					int लक्ष्यः=स्थानम्+अतिक्रमः;
					if(लक्ष्यः<0)लक्ष्यः+=अवकाशः;
					return सङ्ग्रहः[लक्ष्यः];
				}
				else if(!लोपः)return मौनम्;
				else throw(अतिक्रमः);
			}
			else
			{
				if(अतिक्रमः<=अन्तरम्(स्थानम्,अन्तः))
				{
					int लक्ष्यः=स्थानम्+अतिक्रमः;
					if(लक्ष्यः>अवकाशः)लक्ष्यः-=अवकाशः;
					return सङ्ग्रहः[लक्ष्यः];
				}
				else if(अतिक्रमः<अवकाशः)
				{
					int लक्ष्यः=स्थानम्+अतिक्रमः;
					if(लक्ष्यः>=अवकाशः)लक्ष्यः-=अवकाशः;
					while(अन्तः!=लक्ष्यः)
					{
						वृद्धिः(अन्तः);
						if(अन्तः==आदिः){वृद्धिः(आदिः);लोपः=true;}
						सङ्ग्रहः[अन्तः]=वर्णाः.क्रमणम्(वर्णाः.अन्वयः);
					}
					return सङ्ग्रहः[लक्ष्यः];
				}
				else throw(अतिक्रमः);
			}
		}
		void क्रमणम्()
		{
			if(स्थानम्!=अन्तः)वृद्धिः(स्थानम्);
			else
			{
				वृद्धिः(अन्तः);
				स्थानम्=अन्तः;
				if(अन्तः==आदिः){वृद्धिः(आदिः);लोपः=true;}
				सङ्ग्रहः[अन्तः]=वर्णाः.क्रमणम्(वर्णाः.अन्वयः);
			}
		}
	};
	वर्णसङ्ग्रहः पाठः;
	static const int भागसङ्ख्या=44,नासिकास्थानम्=16;
	वाचकम्(वर्णसङ्ग्रहः::वर्णक्रमः यद्वर्णाः):यन्त्रम्(भागसङ्ख्या,नासिकास्थानम्,0.17),पाठः(यद्वर्णाः)
	{
		std::fill_n(यन्त्रम्.मुखविस्तारः,यन्त्रम्.नासिकास्थानम्,0.5);
		std::fill_n(यन्त्रम्.मुखविस्तारः+यन्त्रम्.नासिकास्थानम्,यन्त्रम्.नासिक्यभागाः,1);
		std::fill_n(यन्त्रम्.नासिकाविस्तारः,यन्त्रम्.नासिक्यभागाः,1);
	}
	वाचकम्(const वाचकम् &)=delete;
	वाचकम्& operator=(const वाचकम् &)=delete;
	
	
	सङ्ख्या कण्ठ्यम्=0;
	सङ्ख्या कण्ठ्यान्तरम्=1/120.0;
	
	struct
	{
		सङ्ख्या आदिकालः=0,अन्तकालः=0.1;
		
		bool कण्ठ्यम्=false,कण्ठ्यभेदः=false;
		सङ्ख्या कण्ठ्यमात्राः[3],कण्ठ्यकालाः[4];
		
		bool विवारभेदः=false,मध्यस्थितिः=false;
		सङ्ख्या विवारः[3][भागसङ्ख्या],विवारकालौ[2];
		
		सङ्ख्या स्पर्शः=0,स्पर्शकालाः[4];
		int स्पर्शस्थानम्;
		
		सङ्ख्या श्वसनम्=0,श्वसनकालाः[4];
		
		सङ्ख्या नासिक्यौ[2]={0.1,0.1};
		
	}प्रयत्नः;
		
	void प्रभावः()
	{
		if(कालः>प्रयत्नः.अन्तकालः)पठनम्();
		if(प्रयत्नः.कण्ठ्यम्)
		{
			सङ्ख्या कण्ठ्यमात्रा;
			if(प्रयत्नः.कण्ठ्यभेदः)कण्ठ्यमात्रा=
				कालः<प्रयत्नः.कण्ठ्यकालाः[0]?प्रयत्नः.कण्ठ्यमात्राः[0]
				:कालः>प्रयत्नः.कण्ठ्यकालाः[3]?प्रयत्नः.कण्ठ्यमात्राः[2]
				:कालः<प्रयत्नः.कण्ठ्यकालाः[1]?
				(कालः-प्रयत्नः.कण्ठ्यकालाः[0])*(प्रयत्नः.कण्ठ्यमात्राः[1]-प्रयत्नः.कण्ठ्यमात्राः[0])/(प्रयत्नः.कण्ठ्यकालाः[1]-प्रयत्नः.कण्ठ्यकालाः[0])+प्रयत्नः.कण्ठ्यमात्राः[0]
				:कालः>प्रयत्नः.कण्ठ्यकालाः[2]?
				(कालः-प्रयत्नः.कण्ठ्यकालाः[2])*(प्रयत्नः.कण्ठ्यमात्राः[2]-प्रयत्नः.कण्ठ्यमात्राः[1])/(प्रयत्नः.कण्ठ्यकालाः[3]-प्रयत्नः.कण्ठ्यकालाः[2])+प्रयत्नः.कण्ठ्यमात्राः[1]
				:प्रयत्नः.कण्ठ्यमात्राः[1];
			else कण्ठ्यमात्रा=प्रयत्नः.कण्ठ्यमात्राः[1];
			सङ्ख्या कण्ठ्यावधिः=1/600.0;
			सङ्ख्या कण्ठ्यकालः=floor(कालः/कण्ठ्यान्तरम्)*कण्ठ्यान्तरम्;
			if(कालः-कण्ठ्यकालः<कण्ठ्यावधिः)
				कण्ठ्यम्=कण्ठ्यमात्रा*4.0*(कालः-कण्ठ्यकालः)*(कण्ठ्यकालः+कण्ठ्यावधिः-कालः)/कण्ठ्यावधिः/कण्ठ्यावधिः;
		}
		if(प्रयत्नः.विवारभेदः&&((!प्रयत्नः.मध्यस्थितिः&&कालः>प्रयत्नः.विवारकालौ[0]&&कालः<प्रयत्नः.विवारकालौ[1])||(प्रयत्नः.मध्यस्थितिः&&(कालः<प्रयत्नः.विवारकालौ[0]||कालः>प्रयत्नः.विवारकालौ[1]))))
		{
			सङ्ख्या *आद्यविवारः,*अन्त्यविवारः,स्थानम्;
			if(प्रयत्नः.मध्यस्थितिः)
			{
				if(कालः<प्रयत्नः.विवारकालौ[0])
				{
					आद्यविवारः=प्रयत्नः.विवारः[0];
					अन्त्यविवारः=प्रयत्नः.विवारः[1];
					स्थानम्=(कालः-प्रयत्नः.आदिकालः)/(प्रयत्नः.विवारकालौ[0]-प्रयत्नः.आदिकालः);
				}
				else
				{
					आद्यविवारः=प्रयत्नः.विवारः[1];
					अन्त्यविवारः=प्रयत्नः.विवारः[2];
					स्थानम्=(कालः-प्रयत्नः.विवारकालौ[1])/(प्रयत्नः.अन्तकालः-प्रयत्नः.विवारकालौ[1]);
				}
			}
			else
			{
				आद्यविवारः=प्रयत्नः.विवारः[0];
				अन्त्यविवारः=प्रयत्नः.विवारः[2];
				स्थानम्=(कालः-प्रयत्नः.विवारकालौ[0])/(प्रयत्नः.विवारकालौ[1]-प्रयत्नः.विवारकालौ[0]);
			}
			for(int भागः=नासिकास्थानम्;भागः<भागसङ्ख्या;भागः++)यन्त्रम्.मुखविस्तारः[भागः]=आद्यविवारः[भागः]*(1-स्थानम्)+स्थानम्*अन्त्यविवारः[भागः];
		}
		यन्त्रम्.नासिकाविस्तारः[0]=प्रयत्नः.नासिक्यौ[0]+(प्रयत्नः.नासिक्यौ[1]-प्रयत्नः.नासिक्यौ[0])*(कालः-प्रयत्नः.आदिकालः)/(प्रयत्नः.अन्तकालः-प्रयत्नः.आदिकालः);
		if(प्रयत्नः.स्पर्शः&&कालः>प्रयत्नः.स्पर्शकालाः[0]&&कालः<प्रयत्नः.स्पर्शकालाः[3])
		{
			सङ्ख्या मात्रा=प्रयत्नः.स्पर्शः*(
				कालः<प्रयत्नः.स्पर्शकालाः[1]?
				(कालः-प्रयत्नः.स्पर्शकालाः[0])/(प्रयत्नः.स्पर्शकालाः[1]-प्रयत्नः.स्पर्शकालाः[0])
				:कालः<प्रयत्नः.स्पर्शकालाः[2]?
				1.0
				:(प्रयत्नः.स्पर्शकालाः[3]-कालः)/(प्रयत्नः.स्पर्शकालाः[3]-प्रयत्नः.स्पर्शकालाः[2]));
			यन्त्रम्.योजनम्(प्रयत्नः.स्पर्शस्थानम्,मात्रा*((float)rand()/(float)RAND_MAX));
		}
		if(प्रयत्नः.श्वसनम्&&कालः>प्रयत्नः.श्वसनकालाः[0]&&कालः<प्रयत्नः.श्वसनकालाः[3])
		{
			सङ्ख्या मात्रा=प्रयत्नः.श्वसनम्*(
				कालः<प्रयत्नः.श्वसनकालाः[1]?
				(कालः-प्रयत्नः.श्वसनकालाः[0])/(प्रयत्नः.श्वसनकालाः[1]-प्रयत्नः.श्वसनकालाः[0])
				:कालः<प्रयत्नः.श्वसनकालाः[2]?
				1.0
				:(प्रयत्नः.श्वसनकालाः[3]-कालः)/(प्रयत्नः.श्वसनकालाः[3]-प्रयत्नः.श्वसनकालाः[2]));
			कण्ठ्यम्=मात्रा*((float)rand()/(float)RAND_MAX);
		}
	}
	
	
	
	static constexpr वर्णः
		स्वरः[]={अत्,आत्,इत्,ईत्,उत्,ऊत्,ऋत्,ॠत्,ऌत्,ॡत्,एत्,ऐत्,ओत्,औत्},
		ह्रस्वः[]={अत्,इत्,उत्,ऋत्,ऌत्},
		दीर्घः[]={आत्,ईत्,ऊत्,ॠत्,ॡत्,एत्,ऐत्,ओत्,औत्},
		उष्मा[]={शः,षः,सः,हः},
		अन्तःस्थः[]={यः,रः,लः,वः},
		नासिक्यः[]={अनुस्वारः,ङः,ञः,णः,नः,मः},
		वर्गीयः[]={कः,खः,गः,घः,ङः,चः,छः,जः,झः,ञः,टः,ठः,डः,ढः,णः,तः,थः,दः,धः,नः,पः,फः,बः,भः,मः},
		खरः[]={कः,चः,टः,तः,पः},
		अतिखरः[]={खः,छः,ठः,थः,फः},
		मृदुः[]={गः,जः,डः,दः,बः},
		घोषः[]={घः,झः,ढः,धः,भः};
		
		
	template <size_t गणना>
	static bool अधिकारः(वर्णः द्रष्टव्यः,const वर्णः (&गणः)[गणना])
	{
		for(int क्रमः=0;क्रमः<गणना;क्रमः++)if(द्रष्टव्यः==गणः[क्रमः])return true;
		return false;
	}

	void पठनम्()
	{
		वर्णः पूर्वः=पाठः.पठनम्(-1),पश्चिमः=पाठः.पठनम्(1),उपस्थितः=पाठः.पठनम्();
		//std::cout<<"वर्णः - "<<पूर्वः<<" "<<उपस्थितः<<" "<<पश्चिमः<<std::endl;
		प्रयत्नः.आदिकालः=प्रयत्नः.अन्तकालः;
		सङ्ख्या ह्रस्वावधिः=0.1;
		सङ्ख्या अवधिः=
			उपस्थितः==मौनम्?0.3
			:अधिकारः(उपस्थितः,ह्रस्वः)?ह्रस्वावधिः
			:अधिकारः(उपस्थितः,दीर्घः)?ह्रस्वावधिः*2.0
			:ह्रस्वावधिः;
		प्रयत्नः.अन्तकालः=प्रयत्नः.आदिकालः+अवधिः;
		सङ्ख्या गतिः=0.002;
		प्रयत्नः.कण्ठ्यम्=अधिकारः(उपस्थितः,स्वरः)||अधिकारः(उपस्थितः,अन्तःस्थः)||अधिकारः(उपस्थितः,नासिक्यः)||अधिकारः(उपस्थितः,मृदुः)||अधिकारः(उपस्थितः,घोषः);
		if(प्रयत्नः.कण्ठ्यम्)
		{
			प्रयत्नः.कण्ठ्यभेदः=!((अधिकारः(पूर्वः,स्वरः)||अधिकारः(पूर्वः,अन्तःस्थः)||अधिकारः(पूर्वः,नासिक्यः))
				&&(अधिकारः(उपस्थितः,स्वरः)||अधिकारः(उपस्थितः,अन्तःस्थः)||अधिकारः(उपस्थितः,नासिक्यः))
				&&(अधिकारः(पश्चिमः,स्वरः)||अधिकारः(पश्चिमः,अन्तःस्थः)||अधिकारः(पश्चिमः,नासिक्यः)));
			सङ्ख्या कण्ठ्यमात्रा=1.0;
			प्रयत्नः.कण्ठ्यमात्राः[1]=कण्ठ्यमात्रा;
			प्रयत्नः.कण्ठ्यमात्राः[0]=कण्ठ्यमात्रा*(सङ्ख्या)((अधिकारः(पूर्वः,स्वरः)||अधिकारः(पूर्वः,अन्तःस्थः)||अधिकारः(पूर्वः,नासिक्यः))
				&&(अधिकारः(उपस्थितः,स्वरः)||अधिकारः(उपस्थितः,अन्तःस्थः)||अधिकारः(उपस्थितः,नासिक्यः)));
			प्रयत्नः.कण्ठ्यमात्राः[2]=कण्ठ्यमात्रा*(सङ्ख्या)((अधिकारः(पश्चिमः,स्वरः)||अधिकारः(पश्चिमः,अन्तःस्थः)||अधिकारः(पश्चिमः,नासिक्यः))
				&&(अधिकारः(उपस्थितः,स्वरः)||अधिकारः(उपस्थितः,अन्तःस्थः)||अधिकारः(उपस्थितः,नासिक्यः)));
			प्रयत्नः.कण्ठ्यकालाः[0]=प्रयत्नः.आदिकालः;
			प्रयत्नः.कण्ठ्यकालाः[1]=प्रयत्नः.कण्ठ्यकालाः[0]+गतिः;
			प्रयत्नः.कण्ठ्यकालाः[3]=प्रयत्नः.अन्तकालः;
			प्रयत्नः.कण्ठ्यकालाः[2]=प्रयत्नः.कण्ठ्यकालाः[3]-गतिः;
		}
		प्रयत्नः.विवारभेदः=true;
		प्रयत्नः.मध्यस्थितिः=true;//अधिकारः(उपस्थितः,स्वरः);
		प्रयत्नः.विवारकालौ[0]=
			प्रयत्नः.मध्यस्थितिः?प्रयत्नः.आदिकालः+fminf(0.02,अवधिः/2.0)
			:प्रयत्नः.आदिकालः;
		प्रयत्नः.विवारकालौ[1]=
			प्रयत्नः.मध्यस्थितिः?प्रयत्नः.अन्तकालः-fminf(0.02,अवधिः/2.0)
			:प्रयत्नः.अन्तकालः;
		auto स्थानम्=[](वर्णः उपस्थितः)->int
		{
			वर्णः कण्ठावरोधः[]={अत्,आत्,कः,खः,गः,घः,ङः},
				ताल्ववरोधः[]={एत्,ऐत्,इत्,ईत्,चः,छः,जः,झः,ञः,यः,शः},
				मूर्धावरोधः[]={ऋत्,ॠत्,टः,ठः,डः,ढः,णः,रः,षः},
				दन्तावरोधः[]={ऌत्,ॡत्,तः,थः,दः,धः,नः,लः,सः},
				ओष्ठावरोधः[]={ओत्,औत्,उत्,ऊत्,पः,फः,बः,भः,मः,वः};
			return (
				अधिकारः(उपस्थितः,कण्ठावरोधः)?0
				:अधिकारः(उपस्थितः,ताल्ववरोधः)?0.4
				:अधिकारः(उपस्थितः,मूर्धावरोधः)?0.6
				:अधिकारः(उपस्थितः,दन्तावरोधः)?0.8
				:अधिकारः(उपस्थितः,ओष्ठावरोधः)?1
				:throw(उपस्थितः)
				)*(भागसङ्ख्या-1-नासिकास्थानम्)+नासिकास्थानम्;
		};
		auto विवारः=[स्थानम्](वर्णः उपस्थितः,int भागः)->सङ्ख्या
		{
			if(उपस्थितः==मौनम्||उपस्थितः==हः||उपस्थितः==विसर्गः)return 1.0;
			if(उपस्थितः==अनुस्वारः)return 0.2;
			सङ्ख्या अवकाशः=
				अधिकारः(उपस्थितः,स्वरः)?0.05
				:अधिकारः(उपस्थितः,नासिक्यः)||अधिकारः(उपस्थितः,उष्मा)?0.01
				:अधिकारः(उपस्थितः,वर्गीयः)?0.0001
				:अधिकारः(उपस्थितः,अन्तःस्थः)?0.05:1;
			
			int अवरोधः=स्थानम्(उपस्थितः);
			सङ्ख्या  विवारः=fminf(1.0,अवकाशः+5.0*abs(भागः-अवरोधः)/(सङ्ख्या)भागसङ्ख्या);
			if(उपस्थितः==एत्||उपस्थितः==ओत्)
				विवारः*=1.0+(भागः-नासिकास्थानम्)/(सङ्ख्या)(भागसङ्ख्या-1-नासिकास्थानम्);
			else if(उपस्थितः==ऐत्||उपस्थितः==औत्)
				विवारः*=1.0+2.0*(भागः-नासिकास्थानम्)/(सङ्ख्या)(भागसङ्ख्या-1-नासिकास्थानम्);
			return विवारः;
		};
	
		for(int भागः=नासिकास्थानम्;भागः<भागसङ्ख्या;भागः++)
		{
			प्रयत्नः.विवारः[0][भागः]=fminf(विवारः(पूर्वः,भागः),विवारः(उपस्थितः,भागः));
			प्रयत्नः.विवारः[1][भागः]=विवारः(उपस्थितः,भागः);
			प्रयत्नः.विवारः[2][भागः]=fminf(विवारः(पश्चिमः,भागः),विवारः(उपस्थितः,भागः));
		}
		
		प्रयत्नः.स्पर्शः=
			अधिकारः(उपस्थितः,उष्मा)&&उपस्थितः!=हः?0.01
			:अधिकारः(उपस्थितः,वर्गीयः)&&!अधिकारः(उपस्थितः,नासिक्यः)?0//.01
			:0;
		if(प्रयत्नः.स्पर्शः)
		{
			प्रयत्नः.स्पर्शस्थानम्=स्थानम्(उपस्थितः);
			
			प्रयत्नः.स्पर्शकालाः[0]=
				अधिकारः(उपस्थितः,उष्मा)?प्रयत्नः.आदिकालः
				:प्रयत्नः.अन्तकालः-गतिः;
			प्रयत्नः.स्पर्शकालाः[1]=	
				अधिकारः(उपस्थितः,उष्मा)?प्रयत्नः.स्पर्शकालाः[0]+गतिः
				:प्रयत्नः.स्पर्शकालाः[0];
			प्रयत्नः.स्पर्शकालाः[3]=
				अधिकारः(उपस्थितः,उष्मा)?प्रयत्नः.अन्तकालः
				:प्रयत्नः.अन्तकालः;
			प्रयत्नः.स्पर्शकालाः[2]=
				अधिकारः(उपस्थितः,उष्मा)?प्रयत्नः.स्पर्शकालाः[3]-गतिः
				:प्रयत्नः.स्पर्शकालाः[3];
		}
		
		प्रयत्नः.श्वसनम्=
			उपस्थितः==हः||उपस्थितः==विसर्गः?0.01
			:अधिकारः(उपस्थितः,अतिखरः)||अधिकारः(उपस्थितः,घोषः)?0.2
			:0;
		if(प्रयत्नः.श्वसनम्)
		{
			प्रयत्नः.श्वसनकालाः[0]=प्रयत्नः.आदिकालः;
			प्रयत्नः.श्वसनकालाः[1]=प्रयत्नः.श्वसनकालाः[0]+गतिः;
			प्रयत्नः.श्वसनकालाः[3]=प्रयत्नः.अन्तकालः;
			प्रयत्नः.श्वसनकालाः[2]=प्रयत्नः.श्वसनकालाः[3]-गतिः;
		}
		
		प्रयत्नः.नासिक्यौ[0]=
			अधिकारः(उपस्थितः,नासिक्यः)||अधिकारः(पूर्वः,नासिक्यः)?1
			:0.01;
		प्रयत्नः.नासिक्यौ[1]=
			अधिकारः(उपस्थितः,नासिक्यः)||अधिकारः(पश्चिमः,नासिक्यः)?1
			:0.01;
			
	/*struct
	{
		-- सङ्ख्या आदिकालः=0,अन्तकालः=0;
		
		-- bool कण्ठ्यम्=false,कण्ठ्यभेदः=false;
		-- सङ्ख्या कण्ठ्यमात्राः[3],कण्ठ्यकालाः[4];
		
		-- bool विवारभेदः=false,मध्यस्थितिः=false;
		-- सङ्ख्या विवारः[3][भागसङ्ख्या],विवारकालौ[2];
		
		सङ्ख्या स्पर्शः=0,स्पर्शकालाः[4];
		int स्पर्शस्थानम्;
		
		सङ्ख्या श्वसनम्=0,श्वसनकालाः[4];
		
		सङ्ख्या नासिक्यौ[2];
		
	}प्रयत्नः;*/
		पाठः.क्रमणम्();
	}
	
	सङ्ख्या ग्रहणम्()
	{
		while(true)
		{
			{
				कण्ठ्यम्=0;
				प्रभावः();
				कालः+=यन्त्रम्.प्रवाहः(कण्ठ्यम्);
			}
			{
				int कतिग्रहणानि=कालः*(सङ्ख्या)नैमिषिकानि;
				if(कतिग्रहणानि!=ग्रहणानि)
				{
					ग्रहणानि=कतिग्रहणानि;
					return यन्त्रम्.निर्गतिः()*1.5;
				}
			}
		}
	}
};


int main(int argc,char *argv[])
{
	वर्णः क्रमः[]={वः,ऋत्,दः,धः,इत्,रः,आत्,दः,ऐत्,चः,मौनम्};//{आत्,मौनम्,ईत्,मौनम्,ऊत्,मौनम्,ॠत्,मौनम्,ॡत्,मौनम्,एत्,मौनम्,ऐत्,मौनम्,ओत्,मौनम्,औत्,मौनम्};
	int स्थानम्=0;
	auto क्रमणम्=[&क्रमः,&स्थानम्](){return क्रमः[(स्थानम्++)%(sizeof(क्रमः)/sizeof(वर्णः))];	};
	वाचकम् मुखम्({(वर्णः (*)(void*))([](void* d){return (*static_cast<decltype(क्रमणम्)*>(d))();}),&क्रमणम्});
	
	auto MyAudioCallback=[](void *userdata, Uint8 *stream, int len)
	{
		clock_t आरम्भकालः=clock();
		while(len)
		{
			*((सङ्ख्या*)stream)=((वाचकम्*)userdata)->ग्रहणम्();
			stream+=sizeof(सङ्ख्या);
			len-=sizeof(सङ्ख्या);
		}
		clock_t अन्तकालः=clock();
		double अवधिः=double(अन्तकालः-आरम्भकालः);
		std::cout<<"ग्रहणावधिः -  "<<अवधिः/CLOCKS_PER_SEC<<std::endl;
	};
	
	if (SDL_Init(SDL_INIT_AUDIO|SDL_INIT_VIDEO) < 0)
			return 1;
	
	SDL_Window *दर्शनम्=SDL_CreateWindow(
        "वाचकम्",                  // window title
        SDL_WINDOWPOS_UNDEFINED,           // initial x position
        SDL_WINDOWPOS_UNDEFINED,           // initial y position
        480,                               // width, in pixels
        480,                               // height, in pixels
        0                  // flags - see below
    );
  
  SDL_Renderer* चित्रकारः=SDL_CreateRenderer(दर्शनम्,-1,0);
  SDL_RenderClear(चित्रकारः);
  SDL_RenderPresent(चित्रकारः);
  
  SDL_AudioSpec want, have;
	SDL_AudioDeviceID dev;

	SDL_memset(&want, 0, sizeof(want)); /* or SDL_zero(want) */
	want.freq = मुखम्.नैमिषिकानि;
	want.format = AUDIO_F32;
	want.channels = 1;
	want.samples = मुखम्.नैमिषिकानि;
	want.callback = MyAudioCallback; /* you wrote this function elsewhere -- see SDL_AudioSpec for details */
	want.userdata=&मुखम्;
	
	dev = SDL_OpenAudioDevice(NULL, 0, &want, &have, 0);
	if (dev == 0) {
	    return 1;
	}
	SDL_PauseAudioDevice(dev, 0); /* start audio playing. */
	
	bool वर्त्तनम्=true;
	while (वर्त्तनम्) {
    SDL_Event event;
    while (SDL_PollEvent(&event)) {
        /* handle your event here */
    	if(event.type==SDL_KEYDOWN)
      {
				if(event.key.keysym.sym == SDLK_ESCAPE)वर्त्तनम्=false;
			}
    }
		SDL_Delay(16);
    /* do some other stuff here -- draw your app, etc. */
	}
	SDL_DestroyWindow(दर्शनम्);
	SDL_CloseAudioDevice(dev);
	SDL_Quit();
	return 0;
}
